OpenNuvoton/NuTool-PinConfigure/Header/M253/sys.h
/* PA.5 MFP */
#define SYS_GPA_MFPL_PA5MFP_GPIO          (0x00UL<<SYS_GPA_MFPL_PA5MFP_Pos) /*!< GPA_MFPL PA5 setting for GPIO          */
#define SYS_GPA_MFPL_PA5MFP_CAN0_TXD      (0x02UL<<SYS_GPA_MFPL_PA5MFP_Pos) /*!< GPA_MFPL PA5 setting for CAN0_TXD      */
#define SYS_GPA_MFPL_PA5MFP_UART0_nCTS    (0x07UL<<SYS_GPA_MFPL_PA5MFP_Pos) /*!< GPA_MFPL PA5 setting for UART0_nCTS    */
#define SYS_GPA_MFPL_PA5MFP_UART0_TXD     (0x08UL<<SYS_GPA_MFPL_PA5MFP_Pos) /*!< GPA_MFPL PA5 setting for UART0_TXD     */
#define SYS_GPA_MFPL_PA5MFP_I2C0_SCL      (0x09UL<<SYS_GPA_MFPL_PA5MFP_Pos) /*!< GPA_MFPL PA5 setting for I2C0_SCL      */
#define SYS_GPA_MFPL_PA5MFP_BPWM0_CH5     (0x0cUL<<SYS_GPA_MFPL_PA5MFP_Pos) /*!< GPA_MFPL PA5 setting for BPWM0_CH5     */

/* PA.6 MFP */
#define SYS_GPA_MFPL_PA6MFP_GPIO          (0x00UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< GPA_MFPL PA6 setting for GPIO          */
#define SYS_GPA_MFPL_PA6MFP_UART0_RXD     (0x07UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< GPA_MFPL PA6 setting for UART0_RXD     */
#define SYS_GPA_MFPL_PA6MFP_I2C1_SDA      (0x08UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< GPA_MFPL PA6 setting for I2C1_SDA      */
#define SYS_GPA_MFPL_PA6MFP_TM3           (0x0eUL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< GPA_MFPL PA6 setting for TM3           */
#define SYS_GPA_MFPL_PA6MFP_INT0          (0x0fUL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< GPA_MFPL PA6 setting for INT0          */

/* PA.7 MFP */
#define SYS_GPA_MFPL_PA7MFP_GPIO          (0x00UL<<SYS_GPA_MFPL_PA7MFP_Pos) /*!< GPA_MFPL PA7 setting for GPIO          */
#define SYS_GPA_MFPL_PA7MFP_UART0_TXD     (0x07UL<<SYS_GPA_MFPL_PA7MFP_Pos) /*!< GPA_MFPL PA7 setting for UART0_TXD     */
#define SYS_GPA_MFPL_PA7MFP_I2C1_SCL      (0x08UL<<SYS_GPA_MFPL_PA7MFP_Pos) /*!< GPA_MFPL PA7 setting for I2C1_SCL      */
#define SYS_GPA_MFPL_PA7MFP_TM2           (0x0eUL<<SYS_GPA_MFPL_PA7MFP_Pos) /*!< GPA_MFPL PA7 setting for TM2           */
#define SYS_GPA_MFPL_PA7MFP_INT1          (0x0fUL<<SYS_GPA_MFPL_PA7MFP_Pos) /*!< GPA_MFPL PA7 setting for INT1          */

/* PA.8 MFP */
#define SYS_GPA_MFPH_PA8MFP_GPIO          (0x00UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< GPA_MFPH PA8 setting for GPIO          */
#define SYS_GPA_MFPH_PA8MFP_USCI0_CTL1    (0x06UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< GPA_MFPH PA8 setting for USCI0_CTL1    */
#define SYS_GPA_MFPH_PA8MFP_UART1_RXD     (0x07UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< GPA_MFPH PA8 setting for UART1_RXD     */
#define SYS_GPA_MFPH_PA8MFP_BPWM0_CH3     (0x09UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< GPA_MFPH PA8 setting for BPWM0_CH3     */
#define SYS_GPA_MFPH_PA8MFP_TM3_EXT       (0x0dUL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< GPA_MFPH PA8 setting for TM3_EXT       */
#define SYS_GPA_MFPH_PA8MFP_INT4          (0x0fUL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< GPA_MFPH PA8 setting for INT4          */

/* PA.9 MFP */
#define SYS_GPA_MFPH_PA9MFP_GPIO          (0x00UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< GPA_MFPH PA9 setting for GPIO          */
#define SYS_GPA_MFPH_PA9MFP_USCI0_DAT1    (0x06UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< GPA_MFPH PA9 setting for USCI0_DAT1    */
#define SYS_GPA_MFPH_PA9MFP_UART1_TXD     (0x07UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< GPA_MFPH PA9 setting for UART1_TXD     */
#define SYS_GPA_MFPH_PA9MFP_BPWM0_CH2     (0x09UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< GPA_MFPH PA9 setting for BPWM0_CH2     */
#define SYS_GPA_MFPH_PA9MFP_TM2_EXT       (0x0dUL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< GPA_MFPH PA9 setting for TM2_EXT       */

/* PA.10 MFP */
#define SYS_GPA_MFPH_PA10MFP_GPIO         (0x00UL<<SYS_GPA_MFPH_PA10MFP_Pos)/*!< GPA_MFPH PA10 setting for GPIO         */
#define SYS_GPA_MFPH_PA10MFP_USCI0_DAT0   (0x06UL<<SYS_GPA_MFPH_PA10MFP_Pos)/*!< GPA_MFPH PA10 setting for USCI0_DAT0   */
#define SYS_GPA_MFPH_PA10MFP_BPWM0_CH1    (0x09UL<<SYS_GPA_MFPH_PA10MFP_Pos)/*!< GPA_MFPH PA10 setting for BPWM0_CH1    */
#define SYS_GPA_MFPH_PA10MFP_TM1_EXT      (0x0dUL<<SYS_GPA_MFPH_PA10MFP_Pos)/*!< GPA_MFPH PA10 setting for TM1_EXT      */

/* PA.11 MFP */
#define SYS_GPA_MFPH_PA11MFP_GPIO         (0x00UL<<SYS_GPA_MFPH_PA11MFP_Pos)/*!< GPA_MFPH PA11 setting for GPIO         */
#define SYS_GPA_MFPH_PA11MFP_USCI0_CLK    (0x06UL<<SYS_GPA_MFPH_PA11MFP_Pos)/*!< GPA_MFPH PA11 setting for USCI0_CLK    */
#define SYS_GPA_MFPH_PA11MFP_BPWM0_CH0    (0x09UL<<SYS_GPA_MFPH_PA11MFP_Pos)/*!< GPA_MFPH PA11 setting for BPWM0_CH0    */
#define SYS_GPA_MFPH_PA11MFP_TM0_EXT      (0x0dUL<<SYS_GPA_MFPH_PA11MFP_Pos)/*!< GPA_MFPH PA11 setting for TM0_EXT      */

/* PB.0 MFP */
#define SYS_GPB_MFPL_PB0MFP_GPIO          (0x00UL<<SYS_GPB_MFPL_PB0MFP_Pos) /*!< GPB_MFPL PB0 setting for GPIO          */
#define SYS_GPB_MFPL_PB0MFP_EADC0_CH0     (0x01UL<<SYS_GPB_MFPL_PB0MFP_Pos) /*!< GPB_MFPL PB0 setting for EADC0_CH0     */
#define SYS_GPB_MFPL_PB0MFP_UART2_RXD     (0x07UL<<SYS_GPB_MFPL_PB0MFP_Pos) /*!< GPB_MFPL PB0 setting for UART2_RXD     */
#define SYS_GPB_MFPL_PB0MFP_SPI0_I2SMCLK  (0x08UL<<SYS_GPB_MFPL_PB0MFP_Pos) /*!< GPB_MFPL PB0 setting for SPI0_I2SMCLK  */
#define SYS_GPB_MFPL_PB0MFP_I2C1_SDA      (0x09UL<<SYS_GPB_MFPL_PB0MFP_Pos) /*!< GPB_MFPL PB0 setting for I2C1_SDA      */

/* PB.1 MFP */
#define SYS_GPB_MFPL_PB1MFP_GPIO          (0x00UL<<SYS_GPB_MFPL_PB1MFP_Pos) /*!< GPB_MFPL PB1 setting for GPIO          */
#define SYS_GPB_MFPL_PB1MFP_EADC0_CH1     (0x01UL<<SYS_GPB_MFPL_PB1MFP_Pos) /*!< GPB_MFPL PB1 setting for EADC0_CH1     */
#define SYS_GPB_MFPL_PB1MFP_UART2_TXD     (0x07UL<<SYS_GPB_MFPL_PB1MFP_Pos) /*!< GPB_MFPL PB1 setting for UART2_TXD     */
#define SYS_GPB_MFPL_PB1MFP_I2C1_SCL      (0x09UL<<SYS_GPB_MFPL_PB1MFP_Pos) /*!< GPB_MFPL PB1 setting for I2C1_SCL      */

/* PB.2 MFP */
#define SYS_GPB_MFPL_PB2MFP_GPIO          (0x00UL<<SYS_GPB_MFPL_PB2MFP_Pos) /*!< GPB_MFPL PB2 setting for GPIO          */
#define SYS_GPB_MFPL_PB2MFP_EADC0_CH2     (0x01UL<<SYS_GPB_MFPL_PB2MFP_Pos) /*!< GPB_MFPL PB2 setting for EADC0_CH2     */
#define SYS_GPB_MFPL_PB2MFP_I2C1_SDA      (0x04UL<<SYS_GPB_MFPL_PB2MFP_Pos) /*!< GPB_MFPL PB2 setting for I2C1_SDA      */
#define SYS_GPB_MFPL_PB2MFP_UART1_RXD     (0x06UL<<SYS_GPB_MFPL_PB2MFP_Pos) /*!< GPB_MFPL PB2 setting for UART1_RXD     */
#define SYS_GPB_MFPL_PB2MFP_TM3           (0x0eUL<<SYS_GPB_MFPL_PB2MFP_Pos) /*!< GPB_MFPL PB2 setting for TM3           */
#define SYS_GPB_MFPL_PB2MFP_INT3          (0x0fUL<<SYS_GPB_MFPL_PB2MFP_Pos) /*!< GPB_MFPL PB2 setting for INT3          */

