OpenNuvoton/NuTool-PinConfigure/Header/M253/sys.h
/* PB.3 MFP */
#define SYS_GPB_MFPL_PB3MFP_GPIO          (0x00UL<<SYS_GPB_MFPL_PB3MFP_Pos) /*!< GPB_MFPL PB3 setting for GPIO          */
#define SYS_GPB_MFPL_PB3MFP_EADC0_CH3     (0x01UL<<SYS_GPB_MFPL_PB3MFP_Pos) /*!< GPB_MFPL PB3 setting for EADC0_CH3     */
#define SYS_GPB_MFPL_PB3MFP_I2C1_SCL      (0x04UL<<SYS_GPB_MFPL_PB3MFP_Pos) /*!< GPB_MFPL PB3 setting for I2C1_SCL      */
#define SYS_GPB_MFPL_PB3MFP_UART1_TXD     (0x06UL<<SYS_GPB_MFPL_PB3MFP_Pos) /*!< GPB_MFPL PB3 setting for UART1_TXD     */
#define SYS_GPB_MFPL_PB3MFP_TM2           (0x0eUL<<SYS_GPB_MFPL_PB3MFP_Pos) /*!< GPB_MFPL PB3 setting for TM2           */
#define SYS_GPB_MFPL_PB3MFP_INT2          (0x0fUL<<SYS_GPB_MFPL_PB3MFP_Pos) /*!< GPB_MFPL PB3 setting for INT2          */

/* PB.4 MFP */
#define SYS_GPB_MFPL_PB4MFP_GPIO          (0x00UL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< GPB_MFPL PB4 setting for GPIO          */
#define SYS_GPB_MFPL_PB4MFP_EADC0_CH4     (0x01UL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< GPB_MFPL PB4 setting for EADC0_CH4     */
#define SYS_GPB_MFPL_PB4MFP_I2C0_SDA      (0x06UL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< GPB_MFPL PB4 setting for I2C0_SDA      */
#define SYS_GPB_MFPL_PB4MFP_UART2_RXD     (0x0dUL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< GPB_MFPL PB4 setting for UART2_RXD     */
#define SYS_GPB_MFPL_PB4MFP_TM1           (0x0eUL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< GPB_MFPL PB4 setting for TM1           */
#define SYS_GPB_MFPL_PB4MFP_INT1          (0x0fUL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< GPB_MFPL PB4 setting for INT1          */

/* PB.5 MFP */
#define SYS_GPB_MFPL_PB5MFP_GPIO          (0x00UL<<SYS_GPB_MFPL_PB5MFP_Pos) /*!< GPB_MFPL PB5 setting for GPIO          */
#define SYS_GPB_MFPL_PB5MFP_EADC0_CH5     (0x01UL<<SYS_GPB_MFPL_PB5MFP_Pos) /*!< GPB_MFPL PB5 setting for EADC0_CH5     */
#define SYS_GPB_MFPL_PB5MFP_I2C0_SCL      (0x06UL<<SYS_GPB_MFPL_PB5MFP_Pos) /*!< GPB_MFPL PB5 setting for I2C0_SCL      */
#define SYS_GPB_MFPL_PB5MFP_UART2_TXD     (0x0dUL<<SYS_GPB_MFPL_PB5MFP_Pos) /*!< GPB_MFPL PB5 setting for UART2_TXD     */
#define SYS_GPB_MFPL_PB5MFP_TM0           (0x0eUL<<SYS_GPB_MFPL_PB5MFP_Pos) /*!< GPB_MFPL PB5 setting for TM0           */
#define SYS_GPB_MFPL_PB5MFP_INT0          (0x0fUL<<SYS_GPB_MFPL_PB5MFP_Pos) /*!< GPB_MFPL PB5 setting for INT0          */

/* PB.6 MFP */
#define SYS_GPB_MFPL_PB6MFP_GPIO          (0x00UL<<SYS_GPB_MFPL_PB6MFP_Pos) /*!< GPB_MFPL PB6 setting for GPIO          */
#define SYS_GPB_MFPL_PB6MFP_EADC0_CH6     (0x01UL<<SYS_GPB_MFPL_PB6MFP_Pos) /*!< GPB_MFPL PB6 setting for EADC0_CH6     */
#define SYS_GPB_MFPL_PB6MFP_UART1_RXD     (0x06UL<<SYS_GPB_MFPL_PB6MFP_Pos) /*!< GPB_MFPL PB6 setting for UART1_RXD     */
#define SYS_GPB_MFPL_PB6MFP_INT4          (0x0dUL<<SYS_GPB_MFPL_PB6MFP_Pos) /*!< GPB_MFPL PB6 setting for INT4          */

/* PB.7 MFP */
#define SYS_GPB_MFPL_PB7MFP_GPIO          (0x00UL<<SYS_GPB_MFPL_PB7MFP_Pos) /*!< GPB_MFPL PB7 setting for GPIO          */
#define SYS_GPB_MFPL_PB7MFP_EADC0_CH7     (0x01UL<<SYS_GPB_MFPL_PB7MFP_Pos) /*!< GPB_MFPL PB7 setting for EADC0_CH7     */
#define SYS_GPB_MFPL_PB7MFP_UART1_TXD     (0x06UL<<SYS_GPB_MFPL_PB7MFP_Pos) /*!< GPB_MFPL PB7 setting for UART1_TXD     */
#define SYS_GPB_MFPL_PB7MFP_INT5          (0x0dUL<<SYS_GPB_MFPL_PB7MFP_Pos) /*!< GPB_MFPL PB7 setting for INT5          */

/* PB.12 MFP */
#define SYS_GPB_MFPH_PB12MFP_GPIO         (0x00UL<<SYS_GPB_MFPH_PB12MFP_Pos)/*!< GPB_MFPH PB12 setting for GPIO         */
#define SYS_GPB_MFPH_PB12MFP_EADC0_CH12   (0x01UL<<SYS_GPB_MFPH_PB12MFP_Pos)/*!< GPB_MFPH PB12 setting for EADC0_CH12   */
#define SYS_GPB_MFPH_PB12MFP_SPI0_MOSI    (0x04UL<<SYS_GPB_MFPH_PB12MFP_Pos)/*!< GPB_MFPH PB12 setting for SPI0_MOSI    */
#define SYS_GPB_MFPH_PB12MFP_USCI0_CLK    (0x05UL<<SYS_GPB_MFPH_PB12MFP_Pos)/*!< GPB_MFPH PB12 setting for USCI0_CLK    */
#define SYS_GPB_MFPH_PB12MFP_UART0_RXD    (0x06UL<<SYS_GPB_MFPH_PB12MFP_Pos)/*!< GPB_MFPH PB12 setting for UART0_RXD    */
#define SYS_GPB_MFPH_PB12MFP_UART3_nCTS   (0x07UL<<SYS_GPB_MFPH_PB12MFP_Pos)/*!< GPB_MFPH PB12 setting for UART3_nCTS   */
#define SYS_GPB_MFPH_PB12MFP_CAN0_RXD     (0x09UL<<SYS_GPB_MFPH_PB12MFP_Pos)/*!< GPB_MFPH PB12 setting for CAN0_RXD     */
#define SYS_GPB_MFPH_PB12MFP_TM3_EXT      (0x0dUL<<SYS_GPB_MFPH_PB12MFP_Pos)/*!< GPB_MFPH PB12 setting for TM3_EXT      */

/* PB.13 MFP */
#define SYS_GPB_MFPH_PB13MFP_GPIO         (0x00UL<<SYS_GPB_MFPH_PB13MFP_Pos)/*!< GPB_MFPH PB13 setting for GPIO         */
#define SYS_GPB_MFPH_PB13MFP_EADC0_CH13   (0x01UL<<SYS_GPB_MFPH_PB13MFP_Pos)/*!< GPB_MFPH PB13 setting for EADC0_CH13   */
#define SYS_GPB_MFPH_PB13MFP_SPI0_MISO    (0x04UL<<SYS_GPB_MFPH_PB13MFP_Pos)/*!< GPB_MFPH PB13 setting for SPI0_MISO    */
#define SYS_GPB_MFPH_PB13MFP_USCI0_DAT0   (0x05UL<<SYS_GPB_MFPH_PB13MFP_Pos)/*!< GPB_MFPH PB13 setting for USCI0_DAT0   */
#define SYS_GPB_MFPH_PB13MFP_UART0_TXD    (0x06UL<<SYS_GPB_MFPH_PB13MFP_Pos)/*!< GPB_MFPH PB13 setting for UART0_TXD    */
#define SYS_GPB_MFPH_PB13MFP_UART3_nRTS   (0x07UL<<SYS_GPB_MFPH_PB13MFP_Pos)/*!< GPB_MFPH PB13 setting for UART3_nRTS   */
#define SYS_GPB_MFPH_PB13MFP_CAN0_TXD     (0x09UL<<SYS_GPB_MFPH_PB13MFP_Pos)/*!< GPB_MFPH PB13 setting for CAN0_TXD     */
#define SYS_GPB_MFPH_PB13MFP_TM2_EXT      (0x0dUL<<SYS_GPB_MFPH_PB13MFP_Pos)/*!< GPB_MFPH PB13 setting for TM2_EXT      */

/* PB.14 MFP */
#define SYS_GPB_MFPH_PB14MFP_GPIO         (0x00UL<<SYS_GPB_MFPH_PB14MFP_Pos)/*!< GPB_MFPH PB14 setting for GPIO         */
#define SYS_GPB_MFPH_PB14MFP_EADC0_CH14   (0x01UL<<SYS_GPB_MFPH_PB14MFP_Pos)/*!< GPB_MFPH PB14 setting for EADC0_CH14   */
#define SYS_GPB_MFPH_PB14MFP_SPI0_CLK     (0x04UL<<SYS_GPB_MFPH_PB14MFP_Pos)/*!< GPB_MFPH PB14 setting for SPI0_CLK     */
#define SYS_GPB_MFPH_PB14MFP_USCI0_DAT1   (0x05UL<<SYS_GPB_MFPH_PB14MFP_Pos)/*!< GPB_MFPH PB14 setting for USCI0_DAT1   */
#define SYS_GPB_MFPH_PB14MFP_UART0_nRTS   (0x06UL<<SYS_GPB_MFPH_PB14MFP_Pos)/*!< GPB_MFPH PB14 setting for UART0_nRTS   */
#define SYS_GPB_MFPH_PB14MFP_UART3_RXD    (0x07UL<<SYS_GPB_MFPH_PB14MFP_Pos)/*!< GPB_MFPH PB14 setting for UART3_RXD    */
#define SYS_GPB_MFPH_PB14MFP_TM1_EXT      (0x0dUL<<SYS_GPB_MFPH_PB14MFP_Pos)/*!< GPB_MFPH PB14 setting for TM1_EXT      */
#define SYS_GPB_MFPH_PB14MFP_CLKO         (0x0eUL<<SYS_GPB_MFPH_PB14MFP_Pos)/*!< GPB_MFPH PB14 setting for CLKO         */

/* PB.15 MFP */
#define SYS_GPB_MFPH_PB15MFP_GPIO         (0x00UL<<SYS_GPB_MFPH_PB15MFP_Pos)/*!< GPB_MFPH PB15 setting for GPIO         */
#define SYS_GPB_MFPH_PB15MFP_EADC0_CH15   (0x01UL<<SYS_GPB_MFPH_PB15MFP_Pos)/*!< GPB_MFPH PB15 setting for EADC0_CH15   */
#define SYS_GPB_MFPH_PB15MFP_SPI0_SS      (0x04UL<<SYS_GPB_MFPH_PB15MFP_Pos)/*!< GPB_MFPH PB15 setting for SPI0_SS      */
#define SYS_GPB_MFPH_PB15MFP_USCI0_CTL1   (0x05UL<<SYS_GPB_MFPH_PB15MFP_Pos)/*!< GPB_MFPH PB15 setting for USCI0_CTL1   */
#define SYS_GPB_MFPH_PB15MFP_UART0_nCTS   (0x06UL<<SYS_GPB_MFPH_PB15MFP_Pos)/*!< GPB_MFPH PB15 setting for UART0_nCTS   */
#define SYS_GPB_MFPH_PB15MFP_UART3_TXD    (0x07UL<<SYS_GPB_MFPH_PB15MFP_Pos)/*!< GPB_MFPH PB15 setting for UART3_TXD    */
#define SYS_GPB_MFPH_PB15MFP_TM0_EXT      (0x0dUL<<SYS_GPB_MFPH_PB15MFP_Pos)/*!< GPB_MFPH PB15 setting for TM0_EXT      */

/* PC.0 MFP */
#define SYS_GPC_MFPL_PC0MFP_GPIO          (0x00UL<<SYS_GPC_MFPL_PC0MFP_Pos) /*!< GPC_MFPL PC0 setting for GPIO          */
#define SYS_GPC_MFPL_PC0MFP_UART2_RXD     (0x08UL<<SYS_GPC_MFPL_PC0MFP_Pos) /*!< GPC_MFPL PC0 setting for UART2_RXD     */
#define SYS_GPC_MFPL_PC0MFP_I2C0_SDA      (0x09UL<<SYS_GPC_MFPL_PC0MFP_Pos) /*!< GPC_MFPL PC0 setting for I2C0_SDA      */

/* PC.1 MFP */
#define SYS_GPC_MFPL_PC1MFP_GPIO          (0x00UL<<SYS_GPC_MFPL_PC1MFP_Pos) /*!< GPC_MFPL PC1 setting for GPIO          */
#define SYS_GPC_MFPL_PC1MFP_UART2_TXD     (0x08UL<<SYS_GPC_MFPL_PC1MFP_Pos) /*!< GPC_MFPL PC1 setting for UART2_TXD     */
#define SYS_GPC_MFPL_PC1MFP_I2C0_SCL      (0x09UL<<SYS_GPC_MFPL_PC1MFP_Pos) /*!< GPC_MFPL PC1 setting for I2C0_SCL      */

