OpenNuvoton/NuTool-PinConfigure/Header/M253/sys.h
/* PC.2 MFP */
#define SYS_GPC_MFPL_PC2MFP_GPIO          (0x00UL<<SYS_GPC_MFPL_PC2MFP_Pos) /*!< GPC_MFPL PC2 setting for GPIO          */
#define SYS_GPC_MFPL_PC2MFP_UART2_nCTS    (0x08UL<<SYS_GPC_MFPL_PC2MFP_Pos) /*!< GPC_MFPL PC2 setting for UART2_nCTS    */
#define SYS_GPC_MFPL_PC2MFP_UART3_RXD     (0x0bUL<<SYS_GPC_MFPL_PC2MFP_Pos) /*!< GPC_MFPL PC2 setting for UART3_RXD     */

/* PC.3 MFP */
#define SYS_GPC_MFPL_PC3MFP_GPIO          (0x00UL<<SYS_GPC_MFPL_PC3MFP_Pos) /*!< GPC_MFPL PC3 setting for GPIO          */
#define SYS_GPC_MFPL_PC3MFP_UART2_nRTS    (0x08UL<<SYS_GPC_MFPL_PC3MFP_Pos) /*!< GPC_MFPL PC3 setting for UART2_nRTS    */
#define SYS_GPC_MFPL_PC3MFP_UART3_TXD     (0x0bUL<<SYS_GPC_MFPL_PC3MFP_Pos) /*!< GPC_MFPL PC3 setting for UART3_TXD     */

/* PC.4 MFP */
#define SYS_GPC_MFPL_PC4MFP_GPIO          (0x00UL<<SYS_GPC_MFPL_PC4MFP_Pos) /*!< GPC_MFPL PC4 setting for GPIO          */
#define SYS_GPC_MFPL_PC4MFP_UART2_RXD     (0x08UL<<SYS_GPC_MFPL_PC4MFP_Pos) /*!< GPC_MFPL PC4 setting for UART2_RXD     */
#define SYS_GPC_MFPL_PC4MFP_I2C1_SDA      (0x09UL<<SYS_GPC_MFPL_PC4MFP_Pos) /*!< GPC_MFPL PC4 setting for I2C1_SDA      */
#define SYS_GPC_MFPL_PC4MFP_CAN0_RXD      (0x0aUL<<SYS_GPC_MFPL_PC4MFP_Pos) /*!< GPC_MFPL PC4 setting for CAN0_RXD      */
#define SYS_GPC_MFPL_PC4MFP_UART4_RXD     (0x0bUL<<SYS_GPC_MFPL_PC4MFP_Pos) /*!< GPC_MFPL PC4 setting for UART4_RXD     */

/* PC.5 MFP */
#define SYS_GPC_MFPL_PC5MFP_GPIO          (0x00UL<<SYS_GPC_MFPL_PC5MFP_Pos) /*!< GPC_MFPL PC5 setting for GPIO          */
#define SYS_GPC_MFPL_PC5MFP_UART2_TXD     (0x08UL<<SYS_GPC_MFPL_PC5MFP_Pos) /*!< GPC_MFPL PC5 setting for UART2_TXD     */
#define SYS_GPC_MFPL_PC5MFP_I2C1_SCL      (0x09UL<<SYS_GPC_MFPL_PC5MFP_Pos) /*!< GPC_MFPL PC5 setting for I2C1_SCL      */
#define SYS_GPC_MFPL_PC5MFP_CAN0_TXD      (0x0aUL<<SYS_GPC_MFPL_PC5MFP_Pos) /*!< GPC_MFPL PC5 setting for CAN0_TXD      */
#define SYS_GPC_MFPL_PC5MFP_UART4_TXD     (0x0bUL<<SYS_GPC_MFPL_PC5MFP_Pos) /*!< GPC_MFPL PC5 setting for UART4_TXD     */

/* PC.14 MFP */
#define SYS_GPC_MFPH_PC14MFP_GPIO         (0x00UL<<SYS_GPC_MFPH_PC14MFP_Pos)/*!< GPC_MFPH PC14 setting for GPIO         */
#define SYS_GPC_MFPH_PC14MFP_SPI0_I2SMCLK (0x04UL<<SYS_GPC_MFPH_PC14MFP_Pos)/*!< GPC_MFPH PC14 setting for SPI0_I2SMCLK */
#define SYS_GPC_MFPH_PC14MFP_USCI0_CTL0   (0x05UL<<SYS_GPC_MFPH_PC14MFP_Pos)/*!< GPC_MFPH PC14 setting for USCI0_CTL0   */
#define SYS_GPC_MFPH_PC14MFP_TM1          (0x0dUL<<SYS_GPC_MFPH_PC14MFP_Pos)/*!< GPC_MFPH PC14 setting for TM1          */

/* PF.0 MFP */
#define SYS_GPF_MFPL_PF0MFP_GPIO          (0x00UL<<SYS_GPF_MFPL_PF0MFP_Pos) /*!< GPF_MFPL PF0 setting for GPIO          */
#define SYS_GPF_MFPL_PF0MFP_UART1_TXD     (0x02UL<<SYS_GPF_MFPL_PF0MFP_Pos) /*!< GPF_MFPL PF0 setting for UART1_TXD     */
#define SYS_GPF_MFPL_PF0MFP_I2C1_SCL      (0x03UL<<SYS_GPF_MFPL_PF0MFP_Pos) /*!< GPF_MFPL PF0 setting for I2C1_SCL      */
#define SYS_GPF_MFPL_PF0MFP_UART0_TXD     (0x04UL<<SYS_GPF_MFPL_PF0MFP_Pos) /*!< GPF_MFPL PF0 setting for UART0_TXD     */
#define SYS_GPF_MFPL_PF0MFP_ICE_DAT       (0x0eUL<<SYS_GPF_MFPL_PF0MFP_Pos) /*!< GPF_MFPL PF0 setting for ICE_DAT       */

/* PF.1 MFP */
#define SYS_GPF_MFPL_PF1MFP_GPIO          (0x00UL<<SYS_GPF_MFPL_PF1MFP_Pos) /*!< GPF_MFPL PF1 setting for GPIO          */
#define SYS_GPF_MFPL_PF1MFP_UART1_RXD     (0x02UL<<SYS_GPF_MFPL_PF1MFP_Pos) /*!< GPF_MFPL PF1 setting for UART1_RXD     */
#define SYS_GPF_MFPL_PF1MFP_I2C1_SDA      (0x03UL<<SYS_GPF_MFPL_PF1MFP_Pos) /*!< GPF_MFPL PF1 setting for I2C1_SDA      */
#define SYS_GPF_MFPL_PF1MFP_UART0_RXD     (0x04UL<<SYS_GPF_MFPL_PF1MFP_Pos) /*!< GPF_MFPL PF1 setting for UART0_RXD     */
#define SYS_GPF_MFPL_PF1MFP_ICE_CLK       (0x0eUL<<SYS_GPF_MFPL_PF1MFP_Pos) /*!< GPF_MFPL PF1 setting for ICE_CLK       */

/* PF.2 MFP */
#define SYS_GPF_MFPL_PF2MFP_GPIO          (0x00UL<<SYS_GPF_MFPL_PF2MFP_Pos) /*!< GPF_MFPL PF2 setting for GPIO          */
#define SYS_GPF_MFPL_PF2MFP_UART0_RXD     (0x03UL<<SYS_GPF_MFPL_PF2MFP_Pos) /*!< GPF_MFPL PF2 setting for UART0_RXD     */
#define SYS_GPF_MFPL_PF2MFP_I2C0_SDA      (0x04UL<<SYS_GPF_MFPL_PF2MFP_Pos) /*!< GPF_MFPL PF2 setting for I2C0_SDA      */
#define SYS_GPF_MFPL_PF2MFP_XT1_OUT       (0x0aUL<<SYS_GPF_MFPL_PF2MFP_Pos) /*!< GPF_MFPL PF2 setting for XT1_OUT       */

/* PF.3 MFP */
#define SYS_GPF_MFPL_PF3MFP_GPIO          (0x00UL<<SYS_GPF_MFPL_PF3MFP_Pos) /*!< GPF_MFPL PF3 setting for GPIO          */
#define SYS_GPF_MFPL_PF3MFP_UART0_TXD     (0x03UL<<SYS_GPF_MFPL_PF3MFP_Pos) /*!< GPF_MFPL PF3 setting for UART0_TXD     */
#define SYS_GPF_MFPL_PF3MFP_I2C0_SCL      (0x04UL<<SYS_GPF_MFPL_PF3MFP_Pos) /*!< GPF_MFPL PF3 setting for I2C0_SCL      */
#define SYS_GPF_MFPL_PF3MFP_XT1_IN        (0x0aUL<<SYS_GPF_MFPL_PF3MFP_Pos) /*!< GPF_MFPL PF3 setting for XT1_IN        */

/* PF.4 MFP */
#define SYS_GPF_MFPL_PF4MFP_GPIO          (0x00UL<<SYS_GPF_MFPL_PF4MFP_Pos) /*!< GPF_MFPL PF4 setting for GPIO          */
#define SYS_GPF_MFPL_PF4MFP_UART2_TXD     (0x02UL<<SYS_GPF_MFPL_PF4MFP_Pos) /*!< GPF_MFPL PF4 setting for UART2_TXD     */
#define SYS_GPF_MFPL_PF4MFP_UART2_nRTS    (0x04UL<<SYS_GPF_MFPL_PF4MFP_Pos) /*!< GPF_MFPL PF4 setting for UART2_nRTS    */
#define SYS_GPF_MFPL_PF4MFP_BPWM0_CH5     (0x08UL<<SYS_GPF_MFPL_PF4MFP_Pos) /*!< GPF_MFPL PF4 setting for BPWM0_CH5     */
#define SYS_GPF_MFPL_PF4MFP_X32_OUT       (0x0aUL<<SYS_GPF_MFPL_PF4MFP_Pos) /*!< GPF_MFPL PF4 setting for X32_OUT       */

/* PF.5 MFP */
#define SYS_GPF_MFPL_PF5MFP_GPIO          (0x00UL<<SYS_GPF_MFPL_PF5MFP_Pos) /*!< GPF_MFPL PF5 setting for GPIO          */
#define SYS_GPF_MFPL_PF5MFP_UART2_RXD     (0x02UL<<SYS_GPF_MFPL_PF5MFP_Pos) /*!< GPF_MFPL PF5 setting for UART2_RXD     */
#define SYS_GPF_MFPL_PF5MFP_UART2_nCTS    (0x04UL<<SYS_GPF_MFPL_PF5MFP_Pos) /*!< GPF_MFPL PF5 setting for UART2_nCTS    */
#define SYS_GPF_MFPL_PF5MFP_BPWM0_CH4     (0x08UL<<SYS_GPF_MFPL_PF5MFP_Pos) /*!< GPF_MFPL PF5 setting for BPWM0_CH4     */
#define SYS_GPF_MFPL_PF5MFP_X32_IN        (0x0aUL<<SYS_GPF_MFPL_PF5MFP_Pos) /*!< GPF_MFPL PF5 setting for X32_IN        */
#define SYS_GPF_MFPL_PF5MFP_EADC0_ST      (0x0bUL<<SYS_GPF_MFPL_PF5MFP_Pos) /*!< GPF_MFPL PF5 setting for EADC0_ST      */

/* PF.15 MFP */
#define SYS_GPF_MFPH_PF15MFP_GPIO         (0x00UL<<SYS_GPF_MFPH_PF15MFP_Pos)/*!< GPF_MFPH PF15 setting for GPIO         */
#define SYS_GPF_MFPH_PF15MFP_TM2          (0x0dUL<<SYS_GPF_MFPH_PF15MFP_Pos)/*!< GPF_MFPH PF15 setting for TM2          */
#define SYS_GPF_MFPH_PF15MFP_CLKO         (0x0eUL<<SYS_GPF_MFPH_PF15MFP_Pos)/*!< GPF_MFPH PF15 setting for CLKO         */
#define SYS_GPF_MFPH_PF15MFP_INT4         (0x0fUL<<SYS_GPF_MFPH_PF15MFP_Pos)/*!< GPF_MFPH PF15 setting for INT4         */

/*@}*/ /* end of group SYS_EXPORTED_CONSTANTS */

